AUTO_config_TK_pesok/src/DataProcessors/ЗагрузкаСпецификаций/ЗагрузкаСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаСпецификаций</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьИзменениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглятьДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

AUTO_config_TK_pesok/src/InformationRegisters/СогласованиеЦен/СогласованиеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СогласованиеЦен</name>
  <comment>Согласование цен с контрагентами</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <comment>Цена номенклатуры для контрагента</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаБезНалогов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <comment>Срок действия цен</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтклонения</name>
    <comment>Процент отклонения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор взаиморасчетов контрагента</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <comment>(АСУ) Характеристика/серия номенклатуры</comment>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/СогласователиПротоколов/СогласователиПротоколов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СогласователиПротоколов</name>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласователь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШтрихкодыНоменклатуры</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/Enums/СтатусыПротоколовСогласованияЦен/СтатусыПротоколовСогласованияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПротоколовСогласованияЦен</name>
  <enumValues>
    <name>НеТребуетСогласования</name>
  </enumValues>
  <enumValues>
    <name>ТребуетСогласования</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
</mdclass:Enum>

AUTO_config_TK_pesok/src/Documents/ПротоколСогласованияЦен/ПротоколСогласованияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколСогласованияЦен</name>
  <comment>Протокол согласования цен</comment>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>InformationRegister.СогласованиеЦенАкция</registerRecords>
  <registerRecords>InformationRegister.СогласованиеЦен</registerRecords>
  <registerRecords>InformationRegister.ЦеныКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <comment>Валюта документа</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсДокумента</name>
    <comment>Курс валюты документа</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>Тип цен закупки</comment>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <comment>Срок действия протокола</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорВзаиморасчетов</name>
    <comment>Договор по которому ведутся взаиморасчеты с контрагентом</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентОтклонения</name>
    <comment>Процент отклонения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <comment>Дата начала действия</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Документ, на основании которого введен данный</comment>
    <type>
      <types>DocumentRef.ПоступлениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыПротоколовСогласованияЦен</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <comment>Номенклатура (товар, услуга и т.п.)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(АСУ) Характеристика/серия номенклатуры</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>Цена номенклатурной позиции</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНалогов</name>
      <comment>Цена номенклатурной позиции (без НДС)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <comment>Ставка НДС по номенклатурной позиции</comment>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>CatalogRef.ВидыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляПечати</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НеКонтролироватьКвоты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПроверятьПросроченнуюЗадолженность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварныйКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТорговаяПлощадка</name>
    <type>
      <types>CatalogRef.ТорговыеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПродления</name>
    <type>
      <types>EnumRef.ВариантыПродленияДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравоСобственности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоАренда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактАренда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектронныйАренда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыдачаСКассы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AUTO_config_TK_pesok/src/DataProcessors/ЗагрузкаСпецификаций/Forms/Форма/Module.bsl
&НаСервере
Функция  ЗагрузитьНаСервереАвто()
	
	МассивДокументов = Новый Массив;
	
	РезНоменклатура = ПолучитьНоменклатуру();
	
	Если РезНоменклатура.ВсеОк Тогда
		тзНоменклатура = РезНоменклатура.тзНоменклатура;
	Иначе
		МассивДокументов.Добавить(Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",Ложь,Неопределено,РезНоменклатура.ТекстОшибки));
		Возврат МассивДокументов;
	КонецЕсли;
	
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Номенклатура КАК Номенклатура,
	|	ТЗ.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СогласованиеЦен.Номенклатура КАК Номенклатура,
	|	СогласованиеЦен.Контрагент КАК Контрагент,
	|	СогласованиеЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	МАКСИМУМ(СогласованиеЦен.Регистратор.Дата) КАК РегистраторДата
	|ПОМЕСТИТЬ втСогласованиеЦен
	|ИЗ
	|	РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
	|ГДЕ
	|	СогласованиеЦен.СрокДействия >= &Дата
	|	И СогласованиеЦен.Период <= &Дата
	|	И СогласованиеЦен.Номенклатура В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				ВТ.Номенклатура КАК Номенклатура
	|			ИЗ
	|				ВТ КАК ВТ)
	|	И СогласованиеЦен.ДоговорВзаиморасчетов.Контрагент В(&Контрагент)
	|	И СогласованиеЦен.ДоговорВзаиморасчетов.Подразделение В(&Подразделение)
	|	И СогласованиеЦен.ДоговорВзаиморасчетов В(&ДоговорВзаиморасчетов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СогласованиеЦен.Контрагент,
	|	СогласованиеЦен.ДоговорВзаиморасчетов,
	|	СогласованиеЦен.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСогласованиеЦен.Номенклатура КАК Номенклатура,
	|	втСогласованиеЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	втСогласованиеЦен.Контрагент КАК Контрагент,
	|	МАКСИМУМ(СогласованиеЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ втСогласованиеЦенОбщий
	|ИЗ
	|	втСогласованиеЦен КАК втСогласованиеЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
	|		ПО втСогласованиеЦен.Номенклатура = СогласованиеЦен.Номенклатура
	|			И втСогласованиеЦен.ДоговорВзаиморасчетов = СогласованиеЦен.ДоговорВзаиморасчетов
	|			И втСогласованиеЦен.Контрагент = СогласованиеЦен.Контрагент
	|			И втСогласованиеЦен.РегистраторДата = СогласованиеЦен.Регистратор.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	втСогласованиеЦен.Номенклатура,
	|	втСогласованиеЦен.ДоговорВзаиморасчетов,
	|	втСогласованиеЦен.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов КАК Договор,
	|	втСогласованиеЦенОбщий.Номенклатура КАК Номенклатура,
	|	втСогласованиеЦенОбщий.Контрагент КАК Контрагент,
	|	ВТ.Цена КАК Цена
	|ИЗ
	|	втСогласованиеЦенОбщий КАК втСогласованиеЦенОбщий
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	|		ПО втСогласованиеЦенОбщий.Номенклатура = ВТ.Номенклатура
	|ГДЕ
	|	втСогласованиеЦенОбщий.Цена > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	втСогласованиеЦенОбщий.Контрагент,
	|	втСогласованиеЦенОбщий.Номенклатура,
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов,
	|	ВТ.Цена
	|ИТОГИ ПО
	|	Договор";
	
	Запрос.УстановитьПараметр("ТЗ", тзНоменклатура);
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент", Контрагенты);
	Запрос.УстановитьПараметр("Подразделение", Подразделения);	
	Запрос.УстановитьПараметр("ДоговорВзаиморасчетов", Договора);
	
	РезультатЗапроса = Запрос.Выполнить();
	ооо = РезультатЗапроса.Выгрузить();
	
	ВыборкаДоговор = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДоговор.Следующий() Цикл
		
		Док = Документы.ПротоколСогласованияЦен.СоздатьДокумент();
		Док.Автор 					= ПараметрыСеанса.АвторизованныйПользователь;
		Док.ХозОперация 			= ?(Акция,Справочники.ХозОперации.ПротоколСогласованияЦенАкция,Справочники.ХозОперации.ПротоколСогласованияЦен);
		Док.Контрагент 				= ВыборкаДоговор.Договор.Контрагент;
		Док.ДоговорВзаиморасчетов	= ВыборкаДоговор.Договор;
		Док.ТипЦен					= Объект.ТипЦен;
		Док.ДатаНачалаДействия 		= Объект.НачалоПериода;
		Док.СрокДействия			= ?(Акция,Объект.КонецПериода,ДобавитьМесяц(Объект.НачалоПериода,48));
		Док.Организация 			= ВыборкаДоговор.Договор.Организация;
		Док.ПодразделениеКомпании 	= ВыборкаДоговор.Договор.Подразделение; 
		Док.Дата					= ТекущаяДата();
		Док.УстановитьНовыйНомер();
		Док.ВалютаДокумента 		= ВыборкаДоговор.Договор.ВалютаВзаиморасчетов;
		Док.КурсДокумента 			= 1;
		Док.Комментарий 			= Комментарий;
		
		ВыборкаДетальныеЗаписи = ВыборкаДоговор.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрокаТовары = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,ВыборкаДетальныеЗаписи);
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога", НоваяСтрокаТовары.ХарактеристикаНоменклатуры);
			СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрокаТовары.ХарактеристикаНоменклатуры);
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрокаТовары, СтруктураДействий, Неопределено);
		КонецЦикла;
		
		ДокПроведен = Ложь;
		тСообщение = "";
		
		ТекПользователь = Пользователи.ТекущийПользователь();
		МожетПровести   = РегистрыСведений.СогласователиПротоколов.МожетСогласовывать(Объект.ТипЦен, ТекПользователь.ФизическоеЛицо);
		
		Если  НЕ Объект.ТипЦен.ТребуетСогласования Тогда 
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.НеТребуетСогласования;
		ИначеЕсли НЕ МожетПровести И Объект.ТипЦен.ТребуетСогласования и НЕ Согласовано Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.ТребуетСогласования;
		ИначеЕсли  МожетПровести И Объект.ТипЦен.ТребуетСогласования И Согласовано Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.Согласован;
		КонецЕсли;
		
		Попытка
			Док.Записать(РежимЗаписи);
			ДокПроведен = Истина;
			СтруктураВозрата = Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",ДокПроведен,Док.Ссылка,тСообщение);
			МассивДокументов.Добавить(СтруктураВозрата);
		Исключение
			тСообщение = "Документ не проведен! "+ОписаниеОшибки();
			СтруктураВозрата = Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",ДокПроведен,Неопределено,тСообщение);
			МассивДокументов.Добавить(СтруктураВозрата);
		КонецПопытки;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаСервере
Функция  ЗагрузитьНаСервере()
	
	МассивДокументов = Новый Массив;
	
	РезНоменклатура = ПолучитьНоменклатуру();
	
	Если РезНоменклатура.ВсеОк Тогда
		тзНоменклатура = РезНоменклатура.тзНоменклатура;
	Иначе
		МассивДокументов.Добавить(Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",Ложь,Неопределено,РезНоменклатура.ТекстОшибки));
		Возврат МассивДокументов;
	КонецЕсли;
	
	Для Каждого Договор Из Договора Цикл
		
		Если НЕ Объект.Контрагент = Договор.Значение.Контрагент Тогда
			ОбщегоНазначения.СообщитьПользователю("Договор " +Договор.Значение+" не пренадлежит контрагенту "+Объект.Контрагент);
			Продолжить;
		КонецЕсли;
		
		Док = Документы.ПротоколСогласованияЦен.СоздатьДокумент();
		Док.Автор 					= ПараметрыСеанса.АвторизованныйПользователь;
		Док.ХозОперация 			= ?(Акция,Справочники.ХозОперации.ПротоколСогласованияЦенАкция,Справочники.ХозОперации.ПротоколСогласованияЦен);
		Док.Контрагент 				= Объект.Контрагент;
		Док.ДоговорВзаиморасчетов	= Договор.Значение;
		Док.ТипЦен					= Объект.ТипЦен;
		Док.ДатаНачалаДействия 		= Объект.НачалоПериода;
		Док.СрокДействия			= ?(Акция,Объект.КонецПериода,ДобавитьМесяц(Объект.НачалоПериода,48));
		Док.Организация 			= Договор.Значение.Организация;
		Док.ПодразделениеКомпании 	= Договор.Значение.Подразделение; 
		Док.Дата					= ТекущаяДата();
		Док.УстановитьНовыйНомер();
		Док.ВалютаДокумента 		= Договор.Значение.ВалютаВзаиморасчетов;
		Док.КурсДокумента 			= 1;
		Док.Комментарий 			= Комментарий;
		
		Для Каждого Стр Из тзНоменклатура Цикл
			НоваяСтрокаТовары = Док.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары,стр);
			
			СтруктураДействий = Новый Структура;
			СтруктураДействий.Вставить("ПересчитатьЦенаБезНалога", НоваяСтрокаТовары.ХарактеристикаНоменклатуры);
			СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", НоваяСтрокаТовары.ХарактеристикаНоменклатуры);
			СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСПоНоменклатуре");
			
			ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(НоваяСтрокаТовары, СтруктураДействий, Неопределено);
		КонецЦикла;
		
		ДокПроведен = Ложь;
		тСообщение = "";
		
		ТекПользователь = Пользователи.ТекущийПользователь();
		МожетПровести   = РегистрыСведений.СогласователиПротоколов.МожетСогласовывать(Объект.ТипЦен, ТекПользователь.ФизическоеЛицо);
		
		Если  НЕ Объект.ТипЦен.ТребуетСогласования Тогда 
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.НеТребуетСогласования;
		ИначеЕсли НЕ МожетПровести И Объект.ТипЦен.ТребуетСогласования и НЕ Согласовано Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.ТребуетСогласования;
		ИначеЕсли  МожетПровести И Объект.ТипЦен.ТребуетСогласования И Согласовано Тогда
			РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Док.Статус = Перечисления.СтатусыПротоколовСогласованияЦен.Согласован;
		КонецЕсли;

		Попытка
			Док.Записать(РежимЗаписи);
			ДокПроведен = Истина;
			СтруктураВозрата = Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",ДокПроведен,Док.Ссылка,тСообщение);
			МассивДокументов.Добавить(СтруктураВозрата);
		Исключение
			тСообщение = "Документ не проведен! "+ОписаниеОшибки();
			СтруктураВозрата = Новый Структура("ДокПроведен,ДокументСсылка,ТекстОшибки",ДокПроведен,Неопределено,тСообщение);
			МассивДокументов.Добавить(СтруктураВозрата);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если Не ТабДок.ВысотаТаблицы > 1 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для загрузки'; uk = 'Немає даних для завантаження'"));
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.НачалоПериода) ИЛИ
		НЕ ?(Акция,ЗначениеЗаполнено(Объект.КонецПериода), Истина) ИЛИ
		НЕ ?(АвтоДоговор,ЗначениеЗаполнено(Контрагенты),ЗначениеЗаполнено(Объект.Контрагент)) ИЛИ
		НЕ ?(АвтоДоговор,Истина,ЗначениеЗаполнено(Договора)) ИЛИ
		НЕ ЗначениеЗаполнено(Объект.ТипЦен) тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не заполнены основные реквизиты'; uk = 'Немає даних для завантаження'"));
		Возврат;
	КонецЕсли;
	
	ОчиститьСообщения();	
	
	Если АвтоДоговор Тогда
		Рез  = ЗагрузитьНаСервереАвто();
	Иначе
		Рез  = ЗагрузитьНаСервере();
	КонецЕсли;
	
	Для Каждого СтрМассива Из Рез Цикл
		Если СтрМассива.ДокПроведен Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Создан и проведен документ "+  СтрМассива.ДокументСсылка);
			Если Объект.СоздатьИзменениеЦен Тогда
				тПФ = Новый Структура("ИзменениеЦен, Округление, НачалоДействия", СтрМассива.ДокументСсылка, Объект.ОкруглятьДо, ДатаНачалаДействияИзмененияЦен);
				ОткрытьФорму("Обработка.ТК_ВводНаОснованииИзменениеЦен.Форма", тПФ); 
			КонецЕсли;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не создан!" + Символы.ПС + СтрМассива.ТекстОшибки);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	Объект.КонецПериода = КонецДня(Объект.КонецПериода);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТабДок = Обработки.ЗагрузкаСпецификаций.ПолучитьМакет("Макет");
	Элементы.Контрагент.Видимость = НЕ АвтоДоговор;
	Элементы.Контрагенты.Видимость = АвтоДоговор;
	Элементы.ДатаНачалаДействияИзмененияЦен.Видимость = Ложь;
	Элементы.ОкруглятьДо.Видимость = Ложь;
	Элементы.ФормаДоговора.Видимость = Ложь;
	Элементы.КонецПериода.Доступность = Ложь;
	
	врПодразделение = ПараметрыСеанса.АвторизованныйПользователь.Подразделение;
	Если ЗначениеЗаполнено(врПодразделение) Тогда
		Подразделения.Добавить(врПодразделение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменениеЦенПриИзменении(Элемент)
	Если Объект.СоздатьИзменениеЦен = Ложь Тогда
		Элементы.ОкруглятьДо.Видимость = Ложь;
		Элементы.ДатаНачалаДействияИзмененияЦен.Видимость = ЛОжь;
	Иначе
		Элементы.ОкруглятьДо.Видимость = Истина;
		Элементы.ДатаНачалаДействияИзмененияЦен.Видимость = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОчиститьНаСервере()
	ТабДок.Очистить();
	ТабДок = Обработки.ЗагрузкаСпецификаций.ПолучитьМакет("Макет");
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДоговораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыПодбора = Новый Структура();
	ПараметрыПодбора.Вставить("Контрагент",?(АвтоДоговор,Контрагенты,Объект.Контрагент));
	ПараметрыПодбора.Вставить("ВыбранныеДоговора",Договора.ВыгрузитьЗначения());
	ПараметрыПодбора.Вставить("РежимВыбора", Истина);
	ПараметрыПодбора.Вставить("Отбор",Новый Структура("Подразделение",Подразделения));
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.Форма.ФормаВыбораДоговора",ПараметрыПодбора,Элементы.Договора,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОбработатьВыбранныеДоговораНаСервере(ВыбранноеЗначение);	
КонецПроцедуры


&НаСервере
Процедура ОбработатьВыбранныеДоговораНаСервере(АдресхВремХран)
	ВыбДог = ПолучитьИзВременногоХранилища(АдресхВремХран);
	Договора.Очистить();
	Для Каждого СтрДог Из ВыбДог Цикл 
		Договора.Добавить(СтрДог.ДоговорКонтрагента,Строка(СтрДог.ДоговорКонтрагента));
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АвтоДоговорПриИзменении(Элемент)
	Элементы.Контрагент.Видимость = НЕ АвтоДоговор;
	Элементы.Контрагенты.Видимость = АвтоДоговор;
	Элементы.ФормаДоговора.Видимость = АвтоДоговор И ЗначениеЗаполнено(Контрагенты);
КонецПроцедуры

&НаСервере
Функция ПолучитьНоменклатуру()
	
	ВсеОк = Истина;
	
	ТекстОшибки = "";
	
	кАртикул = 1;
	кШтрихкод = 2;
	кНоваяЦена = 3;
	кМРЦ = 4;
	
	ТаблицаЗагрузки = Новый ТаблицаЗначений;
	ТаблицаЗагрузки.Колонки.Добавить("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаЗагрузки.Колонки.Добавить("Цена",Новый ОписаниеТипов("Число"));
	ТаблицаЗагрузки.Колонки.Добавить("ХарактеристикаНоменклатуры",Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
	//ПереборТаблицы
	Для Стр = 2 По ТабДок.ВысотаТаблицы Цикл 
		
		тАртикул = СокрЛП(ТабДок.Область(Стр, кАртикул).Текст);
		тШтрихкод = СокрЛП(ТабДок.Область(Стр, кШтрихкод).Текст);
		тМРЦ = СокрЛП(ТабДок.Область(Стр, кМРЦ).Текст);
		
		Попытка
			тНоваяЦена = Число(СокрЛП(ТабДок.Область(Стр, кНоваяЦена).Текст));
		Исключение
			ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки),Символы.ПС,"")+"Номер строки "+стр+". Артикул : " + тАртикул+". Проверьте правильность указания цен.";
			ВсеОк = Ложь;
			Продолжить;;
		КонецПопытки;
		
		Номенклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", тАртикул);
		
		Если Номенклатура = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Если ПустаяСтрока(тШтрихкод) Тогда
				ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки),Символы.ПС,"")+"Номер строки "+стр+". Не найдена номеклатура с артикулом '" + тАртикул+"'. Проверьте правильность артикула и повторите загрузку.";
				ВсеОк = Ложь;
				Продолжить;
			Иначе
				Попытка
					чШтрихкод = Число(тШтрихкод);
					Номенклатура = РегистрыСведений.ШтрихкодыНоменклатуры.НайтиТоварПоШтрихКоду(тШтрихкод);
					Если Номенклатура = Неопределено Тогда
						ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки),Символы.ПС,"")+"Номер строки "+стр+". Не найдена номеклатура по штрихкоду '" + тШтрихкод+"'. Проверьте правильность штрихкода и повторите загрузку.";
						ВсеОк = Ложь;
						Продолжить;
					КонецЕсли;
				Исключение
					ТекстОшибки = ТекстОшибки + ?(ЗначениеЗаполнено(ТекстОшибки),Символы.ПС,"")+"Номер строки "+стр+". Неверный штрихкод '" + тШтрихкод+"'. Проверьте правильность штрихкода и повторите загрузку.";
					ВсеОк = Ложь;
					Продолжить;;
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаЗагрузки.Добавить();
		НоваяСтрока.Номенклатура = Номенклатура;
		НоваяСтрока.Цена = тНоваяЦена;
		Если тМРЦ = "" Или тМРЦ = "0" Тогда
		Иначе
			Характеристика = Справочники.ХарактеристикиНоменклатуры.ВернутьХарактеристикуПоЗначениюМРЦ(Номенклатура,Число(тМРЦ), ,Истина);
			НоваяСтрока.ХарактеристикаНоменклатуры = Характеристика;
		КонецЕсли;
		
	КонецЦикла;
	
	СтруктураВозрата = Новый Структура("ВсеОк,тзНоменклатура,ТекстОшибки",ВсеОк,ТаблицаЗагрузки,ТекстОшибки);
	
	Возврат СтруктураВозрата;
	
КонецФункции

&НаСервере
//БезКонтекста
Функция ДоговораНаСервере()
	
	РезНоменклатура = ПолучитьНоменклатуру();
	
	Если РезНоменклатура.ВсеОк Тогда
		тзНоменклатура = РезНоменклатура.тзНоменклатура;
	Иначе
		Возврат РезНоменклатура.ТекстОшибки;
	КонецЕсли;
	
	Номенклатура = тзНоменклатура.ВыгрузитьКолонку("Номенклатура");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СогласованиеЦен.Номенклатура КАК Номенклатура,
	|	СогласованиеЦен.Контрагент КАК Контрагент,
	|	СогласованиеЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	МАКСИМУМ(СогласованиеЦен.Регистратор.Дата) КАК РегистраторДата
	|ПОМЕСТИТЬ втСогласованиеЦен
	|ИЗ
	|	РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
	|ГДЕ
	|	СогласованиеЦен.СрокДействия >= &Дата
	|	И СогласованиеЦен.Период <= &Дата
	|	И СогласованиеЦен.Номенклатура В(&Номенклатура)
	|	И СогласованиеЦен.ДоговорВзаиморасчетов.Контрагент В(&Контрагент)
	|	И СогласованиеЦен.ДоговорВзаиморасчетов.Подразделение В(&Подразделение)
	|
	|СГРУППИРОВАТЬ ПО
	|	СогласованиеЦен.Контрагент,
	|	СогласованиеЦен.ДоговорВзаиморасчетов,
	|	СогласованиеЦен.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСогласованиеЦен.Номенклатура КАК Номенклатура,
	|	втСогласованиеЦен.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
	|	втСогласованиеЦен.Контрагент КАК Контрагент,
	|	МАКСИМУМ(СогласованиеЦен.Цена) КАК Цена
	|ПОМЕСТИТЬ втСогласованиеЦенОбщий
	|ИЗ
	|	втСогласованиеЦен КАК втСогласованиеЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СогласованиеЦен КАК СогласованиеЦен
	|		ПО втСогласованиеЦен.Номенклатура = СогласованиеЦен.Номенклатура
	|			И втСогласованиеЦен.ДоговорВзаиморасчетов = СогласованиеЦен.ДоговорВзаиморасчетов
	|			И втСогласованиеЦен.Контрагент = СогласованиеЦен.Контрагент
	|			И втСогласованиеЦен.РегистраторДата = СогласованиеЦен.Регистратор.Дата
	|
	|СГРУППИРОВАТЬ ПО
	|	втСогласованиеЦен.Номенклатура,
	|	втСогласованиеЦен.ДоговорВзаиморасчетов,
	|	втСогласованиеЦен.Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	|ИЗ
	|	втСогласованиеЦенОбщий КАК втСогласованиеЦенОбщий
	|ГДЕ
	|	втСогласованиеЦенОбщий.Цена > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов
	|
	|УПОРЯДОЧИТЬ ПО
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов.Контрагент,
	|	втСогласованиеЦенОбщий.ДоговорВзаиморасчетов.Организация
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Контрагент", Контрагенты);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Подразделение", Подразделения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Договора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ДоговорВзаиморасчетов"));
	
	Возврат "";
	
КонецФункции

&НаКлиенте
Процедура Договора(Команда)
	Если Не ТабДок.ВысотаТаблицы > 1 Тогда 
		ПоказатьПредупреждение(, НСтр("ru = 'Нет товара для проверки'; uk = 'Немає товару для перевірки'"));
		Возврат;
	КонецЕсли;
	
	ТекстОшибки = ДоговораНаСервере();
	
	Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентыПриИзменении(Элемент)
	Элементы.ФормаДоговора.Видимость = АвтоДоговор И ЗначениеЗаполнено(Контрагенты);
КонецПроцедуры


&НаКлиенте
Процедура АкцияПриИзменении(Элемент)
	
	Если Акция Тогда
		Элементы.КонецПериода.Доступность = Истина;
	Иначе
		Элементы.КонецПериода.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры
